Repository: StatCan/datascience-cookiecutter
Catalog: docs/locales/*/LC_MESSAGES/structure.po
Languages: fr

source: ``{{ cookiecutter.repo_name }}`` repository structure
fr: structure du référentiel ``{{ cookiecutter.repo_name }}``

source: Information on the structure of the template folder can be found at :file:`{{ cookiecutter.repo_name }}/docs/structure/index.rst`.
fr: Vous trouverez des informations sur la structure du dossier de modèles à l'adresse :file:`{{ cookiecutter.repo_name }}/docs/structure/index.rst`.

source: ``docs`` folder
fr: dossier ``docs``

source: Holds this project documentation.
fr: Contient la documentation du projet.

source: ``datascience-cookiecutter`` structure
fr: structure du ``datascience-cookiecutter``

source: The repository structure is made up of the following components:
fr: La structure du dépôt est composée des composants suivants :

source: Top-level files
fr: Fichiers de niveau supérieur

source: In addition to the folders idenfied above, the following files are also used.
fr: En plus des dossiers idenfiés ci-dessus, les fichiers suivants sont également utilisé.

source: This provides a baseline for `detect-secrets`_. When paired with ``pre-commit``, ``detect-secrets`` helps prevent secrets from being committed to the repository. The baseline file flags secret-like data that the user deliberatly wants to allow to commit to the repository.
fr: Cela fournit une base pour `detect-secrets`_. Lorsqu'il est associé à ``pre-commit``, ``detect-secrets`` aide à empêcher la validation des secrets au référentiel. Le fichier de référence signale les données de type secret que l'utilisateur veut délibérément autoriser à s'engager dans le référentiel.

source: A :abbr:`JSON (JavaScript Object Notation)` file containing the prompts and default values during template generation. Any keys in the file that begin with an underscore are not shown to users.
fr: Un fichier :abbr:`JSON (JavaScript Object Notation)` contenant les invites et les valeurs par défaut lors de la génération du modèle. Toutes les clés du fichier qui commencez par un trait de soulignement ne sont pas affichés pour les utilisateurs.

source: For more information, see the `cookiecutter`_ package documentation.
fr: Pour plus d'informations, consultez la documentation du package `cookiecutter`_.

source: An overview of the repository with a brief description of its purpose to inform people what the project.
fr: Un aperçu du dépôt avec une brève description de son objectif d'informer les gens de ce que le projet.
